import axios from 'axios';

const API_KEY = '55675951-c5be5de1598e9491b9f323a37';
const BASE_URL = 'https://pixabay.com/api/';

export function getImagesByQuery(query) {
  return axios
    .get(BASE_URL, {
      params: {
        key: API_KEY,
        q: query,
        image_type: 'photo',
        orientation: 'horizontal',
        safesearch: true,
      },
    })
    .then(response => response.data);
}

// ========================================================
// Для організації коду використовуй модульність та синтаксис export/import.
// У файлі pixabay-api.js зберігай функції для виконання HTTP-запитів:
// -------------------------------
// •	getImagesByQuery(query). Ця функція повинна приймати один параметр query (пошукове слово, яке є рядком), здійснювати HTTP-запит і повертати значення властивості data з отриманої відповіді.

//  ------------------ Завдання -3— HTTP-запити -------------------
// Додай у проєкт бібліотеку Axios для написання коду, пов’язаного з HTTP-запитами.
//
// Для бекенду використовуй публічний API сервіс Pixabay. Зареєструйся, отримай свій унікальний ключ доступу і ознайомся з документацією.
// ----------------------------
// Список параметрів рядка запиту, які тобі обов'язково необхідно вказати:
// ----------------------------
// key — твій унікальний ключ доступу до API.
// q — слово для пошуку. Те, що буде вводити користувач.
// image_type — тип зображення. Потрібні тільки фотографії, тому постав значення photo.
// orientation — орієнтація фотографії. Постав значення horizontal.
// safesearch — фільтр за віком. Постав значення true.
// ----------------------------
// У відповіді буде об’єкт із декількома властивостями, в одному з яких (hits) буде масив об’єктів із зображеннями, що задовольнили критерії параметрів запиту.
// Обов’язково винеси функції для HTTP-запитів у файл pixabay-api.js у папці js. Це хороша практика та можливість відпрацювати модульний підхід до розробки.

/**
  |=======================================
  | БИБЛИОТЕКИ
  |=======================================
*/
// --- axios ---
// https://axios.rest/pages/getting-started/first-steps.html
// -------------------------------------------------------------
// Using npm
// npm install axios

/**
  |=======================================
  | IMPORT/EXPORT VIA ECMAScript Modules (ESM)
  |=======================================
*/
// ECMAScript Modules (ESM) — сучасний стандарт системи модулів JavaScript, який відповідає за організацію та уніфікований підхід до імпорту та експорту даних між різними файлами в проєкті.
// ---------------------------------/named/ ---------------------------------
// Іменований експорт (named export) — це спосіб експортування одного або кількох значень з модуля під конкретними іменами.
// ---------------------------------
// За допомогою іменованого експорту можна отримати доступ до будь-якого значення: змінної, функції або об'єкта тощо під певним ім'ям. Пізніше ці значення можна імпортувати в іншому файлі за допомогою цього самого імені.
// --------------------------------------
// **************/export/**************/
// Операція іменованого експорту реалізована конструкцією з export.
// Ось так виглядає синтаксис для іменованого експорту.
// ----------------
// export const makeMessage = username => {
// 	return `Welcome, ${username}!`;
// };
// ----------------
// export const levels = ["easy", "medium", "hard"];
// ------------------------------------------
// Зверни увагу! Кількість іменованих експортів в одному модулі не обмежена, на відміну від експорту за замовчуванням, який може бути тільки один.
// --------------------------------------
//**************/ import /**************/
// Операція іменованого імпорту реалізована конструкцією з import.
// ----------------
// import { name } from "..."
// ----------------
// У будь-якому іншому файлі проєкту можна імпортувати конкретні елементи з іншого файлу (модуля), використовуючи їх імена в конструкції іменованого імпорту.
// ----------------
// import { makeMessage, levels } from "./makeMessage";
// console.log(makeMessage("Jacob")); // "Welcom, Jacob!"
// console.log(levels); // ["easy", "medium", "hard"]
// ------------------------------------------
// Зверни увагу, що при імпорті ми вказуємо конкретні імена, які були використані при експорті. Це дозволяє точно вказати, які значення ми хочемо імпортувати з модуля.
