/**
  |============================
  | include js partials with
  | default @import url()
  |============================
*/

// ---------------------------------
// У файлі main.js напиши всю логіку роботи додатка. Виклики нотифікацій iziToast, усі перевірки на довжину масиву в отриманій відповіді робимо саме в цьому файлі. Імпортуй в нього функції із файлів pixabay-api.js та render-functions.js та викликай їх у відповідний момент.
// ---------------------------------
// IMPORT/EXPORT VIA ECMAScript Modules (ESM)
// ---------------------------------
// ECMAScript Modules (ESM) — сучасний стандарт системи модулів JavaScript, який відповідає за організацію та уніфікований підхід до імпорту та експорту даних між різними файлами в проєкті.
// ---------------------------------/defolt/ ---------------------------------
// У прикладі нижче файл makeMessage.js оголошує та експортує функцію для створення повідомлення за іменем користувача.
// ------------------/export/---------------
// export default function makeMessage(username) {
//         return `Welcome, ${username}!`;
// }
// ------------------------------------------
// Функцію, яку експортує модуль makeMessage.js, можна використовувати у будь-якому іншому файлі проєкту, наприклад, у index.js.
// ------------------/import/---------------
// import makeMessage from "./makeMessage";
// console.log(makeMessage("Jacob")); // "Welcom, Jacob!"
// ------------------------------------------

// ---------------------------------/named/ ---------------------------------
// Іменований експорт (named export) — це спосіб експортування одного або кількох значень з модуля під конкретними іменами.
// ---------------------------------
// За допомогою іменованого експорту можна отримати доступ до будь-якого значення: змінної, функції або об'єкта тощо під певним ім'ям. Пізніше ці значення можна імпортувати в іншому файлі за допомогою цього самого імені.
// ------------------/export/---------------
// Операція іменованого експорту реалізована конструкцією з export.
// Ось так виглядає синтаксис для іменованого експорту.
// ----------------
// export const makeMessage = username => {
// 	return `Welcome, ${username}!`;
// };
// ----------------
// export const levels = ["easy", "medium", "hard"];
// ------------------------------------------
// Зверни увагу! Кількість іменованих експортів в одному модулі не обмежена, на відміну від експорту за замовчуванням, який може бути тільки один.

// ------------------/import/---------------
// Операція іменованого імпорту реалізована конструкцією з import.
// ----------------
// import { name } from "..."
// ----------------
// У будь-якому іншому файлі проєкту можна імпортувати конкретні елементи з іншого файлу (модуля), використовуючи їх імена в конструкції іменованого імпорту.
// ----------------
// import { makeMessage, levels } from "./makeMessage";
// console.log(makeMessage("Jacob")); // "Welcom, Jacob!"
// console.log(levels); // ["easy", "medium", "hard"]
// ------------------------------------------
// Зверни увагу, що при імпорті ми вказуємо конкретні імена, які були використані при експорті. Це дозволяє точно вказати, які значення ми хочемо імпортувати з модуля.
