// ============ 1. Імпорт стилів  CSS ===============//
import './css/styles.css';

// ============ 2. Імпорт функцій ===================//
import { getImagesByQuery } from './js/pixabay-api.js';
import {
  createGallery,
  clearGallery,
  showLoader,
  hideLoader,
} from './js/render-functions.js';

// ============ 3. Імпорт бібліотек ================//
// Описаний у документації
import iziToast from 'izitoast';
// Додатковий імпорт стилів
import 'izitoast/dist/css/iziToast.min.css';

const form = document.querySelector('.form');

form.addEventListener('submit', event => {
  event.preventDefault();
  // Отримуємо значення інпуту через name="query"
  const query = event.currentTarget.elements.query.value.trim();

  if (query === '') {
    iziToast.warning({
      message: 'Please enter search query',
      position: 'topRight',
    });
    return;
  }

  // 1. Очищення старої галереї
  clearGallery();
  // 2. Показ CSS-лоадера
  showLoader();

  getImagesByQuery(query)
    .then(data => {
      if (data.hits.length === 0) {
        iziToast.error({
          message:
            'Sorry, there are no images matching your search query. <br> Please try again!',
          position: 'topRight',
          backgroundColor: 'rgba(239, 64, 64, 0.8)',
          messageColor: '#FFF',
          iconColor: '#FFFFFF',
          theme: 'dark',
        });
        return;
      }
      // викликаємо функцію рендеру createGallery (завантажить картинки)
      createGallery(data.hits);
    })
    .catch(error => {
      iziToast.error({
        message: 'Something went wrong!',
        position: 'topRight',
      });
      console.error(error);
    })
    .finally(() => {
      hideLoader();
      form.reset();
    });
});

/**
  |=======================================
  | ЗАДАНИЕ
  |=======================================
*/

// ==================== main.js =========================
// У файлі main.js напиши всю логіку роботи додатка. Виклики нотифікацій iziToast, усі перевірки на довжину масиву в отриманій відповіді робимо саме в цьому файлі. Імпортуй в нього функції із файлів pixabay-api.js та render-functions.js та викликай їх у відповідний момент.
// Для організації коду використовуй модульність та синтаксис export/import.

// У файлі main.js напиши всю логіку роботи додатка. Виклики нотифікацій iziToast, усі перевірки на довжину масиву в отриманій відповіді робимо саме в цьому файлі. Імпортуй в нього функції із файлів pixabay-api.js та render-functions.js та викликай їх у відповідний момент.

//=================  pixabay-api.js  ======================
// У файлі pixabay-api.js зберігай функції для виконання HTTP-запитів:
// getImagesByQuery(query). Ця функція повинна приймати один параметр query (пошукове слово, яке є рядком), здійснювати HTTP-запит і повертати значення властивості data з отриманої відповіді.

//=================  render-functions.js  ======================
// У файлі render-functions.js створи екземпляр SimpleLightbox для роботи з модальним вікном та зберігай функції для відображення елементів інтерфейсу:
// createGallery(images). Ця функція повинна приймати масив images, створювати HTML-розмітку для галереї, додавати її в контейнер галереї та викликати метод екземпляра SimpleLightbox refresh(). Нічого не повертає.
// clearGallery(). Ця функція нічого не приймає та повинна очищати вміст контейнера галереї. Нічого не повертає.
// showLoader(). Ця функція нічого не приймає, повинна додавати клас для відображення лоадера. Нічого не повертає.
// hideLoader(). Ця функція нічого не приймає, повинна прибирати клас для відображення лоадера. Нічого не повертає.

// =========================== DESCRIPTION ============================
//
// Збери проєкт за допомогою Vite. Ми підготували для тебе готову збірку з усіма додатковими налаштуваннями проєкту та рекомендуємо використовувати саме її.
// https://github.com/goitacademy/vanilla-app-template
//
/// -------------------------------------------------------------------
//  ================== Завдання --1-- Пошук зображень  (pixabay-api.js)
// --------------------------------------------------------------------
// Створи застосунок пошуку зображень за ключовим словом і їх перегляду в галереї. Додай оформлення елементів інтерфейсу згідно з макетом.
// https://www.figma.com/design/DnWoSXuqp1WSnUsTl4236O/HW-7-12-JavaScript--Copy-?node-id=21-7&t=o5knpNAClWrPwUbO-0
//
/// --------------------------------------------------------------------------------------
//  ==================   Завдання --2-- Форма пошуку  (СSS, main.js, render-functions.js)
// ---------------------------------------------------------------------------------------
// Додай в HTML файл розмітку форми. Форма складається з поля вводу для введення пошукового слова і кнопки з типом submit.
// Користувач буде вводити рядок для пошуку в текстове поле, а за сабмітом форми необхідно виконувати HTTP-запит із цим пошуковим рядком.
// При натисканні на кнопку відправки форми, додайте перевірку вмісту текстового поля на наявність порожнього рядка, щоб користувач не міг відправити запит, якщо поле пошуку порожнє.
//
// -----------------------------------------------------------------------------
//  ==================   Завдання --3-- HTTP-запити  (pixabay-api.js)
// -----------------------------------------------------------------------------
// Додай у проєкт бібліотеку Axios для написання коду, пов’язаного з HTTP-запитами.
// https://axios-http.com/
//
// Для бекенду використовуй публічний API сервіс Pixabay. Зареєструйся, отримай свій унікальний ключ доступу і ознайомся з документацією.
// https://pixabay.com/api/docs/
// https://pixabay.com/api/docs/#api_search_images
//
// ----------------------------
// Список параметрів рядка запиту, які тобі обов'язково необхідно вказати:
// ----------------------------
// key — твій унікальний ключ доступу до API.
// q — слово для пошуку. Те, що буде вводити користувач.
// image_type — тип зображення. Потрібні тільки фотографії, тому постав значення photo.
// orientation — орієнтація фотографії. Постав значення horizontal.
// safesearch — фільтр за віком. Постав значення true.
// ----------------------------
// У відповіді буде об’єкт із декількома властивостями, в одному з яких (hits) буде масив об’єктів із зображеннями, що задовольнили критерії параметрів запиту.
// Обов’язково винеси функції для HTTP-запитів у файл pixabay-api.js у папці js. Це хороша практика та можливість відпрацювати модульний підхід до розробки.
// Якщо бекенд повертає порожній масив, це означає, що нічого підходящого не було знайдено. У такому випадку відображай повідомлення з текстом:
// -------------------------------
// Sorry, there are no images matching your search query. Please try again!
// -------------------------------
// Для показу повідомлень використовуй бібліотеку iziToast. Щоб підключити CSS-код бібліотеки до проєкту, необхідно додати ще один імпорт, окрім того, що описаний у документації.
//
// https://github.com/marcelodolza/iziToast
// -------------------------------
// // Описаний у документації
// import iziToast from "izitoast";
// // Додатковий імпорт стилів
// import "izitoast/dist/css/iziToast.min.css";
//
// -----------------------------------------------------------------------------------------------
//  ================ Завдання --4-- Галерея і картки зображень (СSS, main.js, render-functions.js)
// -----------------------------------------------------------------------------------------------
// Елемент галереї (список однотипних елементів <ul class=”gallery”>) уже має бути в HTML-документі. Після виконання HTTP-запитів у нього потрібно додавати розмітку карток зображень.
// -------------------------------
// Кожне зображення описується об'єктом, з якого тебе цікавлять лише такі властивості:
// -------------------------------
// webformatURL — посилання на маленьке зображення для списку карток у галереї
// largeImageURL — посилання на велике зображення для модального вікна
// tags — рядок з описом зображення. Підійде для атрибута alt
// likes — кількість вподобайок
// views — кількість переглядів
// comments — кількість коментарів
// downloads — кількість завантажень
// -------------------------------
// Перед пошуком за новим ключовим словом необхідно повністю очищати вміст галереї, щоб не змішувати результати запитів.
//
// --------------------------------------------------------------------------------------
//  ================ Завдання --5-- Бібліотека SimpleLightbox (СSS, render-functions.js)
// --------------------------------------------------------------------------------------
// Додай відображення великої версії зображення з бібліотекою SimpleLightbox для повноцінної галереї.
// https://github.com/andreknieriem/simplelightbox
//
// Щоб підключити CSS-код бібліотеки до проєкту, необхідно додати ще один імпорт, окрім того, що описаний у документації.
// -------------------------------
// // Описаний у документації
// import SimpleLightbox from "simplelightbox";
// // Додатковий імпорт стилів
// import "simplelightbox/dist/simple-lightbox.min.css";
// -------------------------------
// У розмітці необхідно буде обгорнути кожну картку зображення в посилання, як зазначено в документації в секції Markup.
// https://github.com/andreknieriem/simplelightbox#markup
//
// Бібліотека містить метод refresh(), який обов'язково потрібно викликати щоразу після додавання нових елементів до галереї.
// https://github.com/andreknieriem/simplelightbox#public-methods
//
// Робота модального вікна пов'язана з самою галереєю, тому використання бібліотеки SimpleLightbox і методу екземпляру refresh() буде доцільним у файлі render-functions.js.
//
// --------------------------------------------------------------------------------------
//  ========= Завдання --6-- Індикатор завантаження (СSS, main.js, render-functions.js)
// --------------------------------------------------------------------------------------
// Додай елемент для сповіщення користувача про процес завантаження зображень із бекенду. Завантажувач має з’являтися перед початком HTTP-запиту та зникати після його завершення.
// Замість банального тексту, як це реалізовано в демовідео, використовуй бібліотеку з гарними індикаторами завантаження css-loader. Відеоінструкція з використання цієї бібліотеки є в README.md їхнього репозиторію.
// https://github.com/vineethtrv/css-loader
// https://github.com/vineethtrv/css-loader/blob/master/README.md
//
// --------------------------------------------------------------------------------------
//  ================ На що буде звертати увагу ментор при перевірці:  ===================
// --------------------------------------------------------------------------------------
// Домашня робота містить два посилання: на вихідні файли і живу сторінку на GitHub Pages
// Проєкт зібраний за допомогою Vite
// Консоль в інструментах розробника не містить помилок, попереджень і консоль логів
// До проєкту підключені бібліотеки iziToast, SimpleLightbox та css-loader
// Елементи на сторінці стилізовані згідно з макетом (або власні стилі)
// У файлі pixabay-api.js є функція getImagesByQuery(query) для виконання HTTP-запитів
// У файлі render-functions.js створено екземпляр SimpleLightbox та є функції для відображення елементів інтерфейсу: createGallery(images), clearGallery(), showLoader(), hideLoader()
// У файлі main.js описана вся логіка роботи додатку
// На сторінці присутня форма пошуку зображень за пошуковим словом
// При сабміті форми перед відправкою запиту на бекенд з’являється індикатор завантаження з css-loader та очищаються попередні результати пошуку на сторінці
// При сабміті форми відправляється запит на бекенд по ключовому слову для пошуку зображень з усіма параметрами, що вказані в ТЗ
// Після отримання відповіді від бекенда зникає індикатор завантаження та на сторінці відмальовуються зображення на основі отриманих даних від бекенду, або з’являється повідомлення про те, що підходящих результатів не було знайдено
// Нові зображення додаються в DOM за одну операцію
// Після додавання нових елементів до списку зображень на екземплярі SimpleLightbox викликається метод refresh()
// При кліку на маленьке зображення в галереї відкривається його збільшена версія у модальному вікні з використанням бібліотеки SimpleLightbox
// Під час виконання HTTP-запитів використовуються обробники then() та catch(), щоб опрацьовувати можливі помилки та запобігти “падінню” сторінки
//----------------------------------------------------------------
//
/**
  |=======================================
  | БИБЛИОТЕКИ
  |=======================================
*/
// -------------------------------------------------------------
// --- axios ---
// https://axios.rest/pages/getting-started/first-steps.html
// -------------------------------------------------------------
// Using npm
// npm install axios

/**
  |=======================================
  | IMPORT/EXPORT VIA ECMAScript Modules (ESM)
  |=======================================
*/
// ---------------------------------
// ECMAScript Modules (ESM) — сучасний стандарт системи модулів JavaScript, який відповідає за організацію та уніфікований підхід до імпорту та експорту даних між різними файлами в проєкті.
// ---------------------------------/defolt/ ---------------------------------
// У прикладі нижче файл makeMessage.js оголошує та експортує функцію для створення повідомлення за іменем користувача.
// ------------------/export/---------------
// export default function makeMessage(username) {
//         return `Welcome, ${username}!`;
// }
// ------------------------------------------
// Функцію, яку експортує модуль makeMessage.js, можна використовувати у будь-якому іншому файлі проєкту, наприклад, у index.js.
// ------------------/import/---------------
// import makeMessage from "./makeMessage";
// console.log(makeMessage("Jacob")); // "Welcom, Jacob!"
// ------------------------------------------

// ---------------------------------/named/ ---------------------------------
// Іменований експорт (named export) — це спосіб експортування одного або кількох значень з модуля під конкретними іменами.
// ---------------------------------
// За допомогою іменованого експорту можна отримати доступ до будь-якого значення: змінної, функції або об'єкта тощо під певним ім'ям. Пізніше ці значення можна імпортувати в іншому файлі за допомогою цього самого імені.
// ------------------/export/---------------
// Операція іменованого експорту реалізована конструкцією з export.
// Ось так виглядає синтаксис для іменованого експорту.
// ----------------
// export const makeMessage = username => {
// 	return `Welcome, ${username}!`;
// };
// ----------------
// export const levels = ["easy", "medium", "hard"];
// ------------------------------------------
// Зверни увагу! Кількість іменованих експортів в одному модулі не обмежена, на відміну від експорту за замовчуванням, який може бути тільки один.

// ------------------/import/---------------
// Операція іменованого імпорту реалізована конструкцією з import.
// ----------------
// import { name } from "..."
// ----------------
// У будь-якому іншому файлі проєкту можна імпортувати конкретні елементи з іншого файлу (модуля), використовуючи їх імена в конструкції іменованого імпорту.
// ----------------
// import { makeMessage, levels } from "./makeMessage";
// console.log(makeMessage("Jacob")); // "Welcom, Jacob!"
// console.log(levels); // ["easy", "medium", "hard"]
// ------------------------------------------
// Зверни увагу, що при імпорті ми вказуємо конкретні імена, які були використані при експорті. Це дозволяє точно вказати, які значення ми хочемо імпортувати з модуля.
